#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tadyjp/home-IoT/runs/run-WXGzdPqVCoT4VpPb

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_role.nature_remo_to_dynamo: Refreshing state... [id=nature-remo-to-dynamo]
aws_iam_role.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/soracom_button_to_slack]
aws_kinesis_stream.soracom_button: Refreshing state... [id=arn:aws:kinesis:ap-northeast-1:188529565947:stream/soracom-button]
aws_cloudwatch_log_group.nature_remo_to_dynamo: Refreshing state... [id=/aws/lambda/nature_remo_to_dynamo]
aws_dynamodb_table.nature_remo_sensor: Refreshing state... [id=nature-remo-sensor-2]
aws_iam_role_policy_attachment.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution-20220318035103012700000001]
aws_lambda_function.soracom_button_to_slack: Refreshing state... [id=soracom_button_to_slack]
aws_lambda_event_source_mapping.soracom_button_lambda: Refreshing state... [id=ec065c36-7c11-44b2-a922-c35a6664679f]
aws_lambda_function.nature_remo_to_dynamo: Refreshing state... [id=nature_remo_to_dynamo]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_dynamodb_table.nature_remo_sensor has changed
  ~ resource "aws_dynamodb_table" "nature_remo_sensor" {
        id             = "nature-remo-sensor-2"
        name           = "nature-remo-sensor-2"
      + tags           = {}
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_lambda_event_source_mapping.soracom_button_lambda has changed
  ~ resource "aws_lambda_event_source_mapping" "soracom_button_lambda" {
        id                                 = "ec065c36-7c11-44b2-a922-c35a6664679f"
      ~ last_modified                      = "2022-03-18T04:14:00Z" -> "2022-04-23T14:14:00Z"
      ~ last_processing_result             = "OK" -> "PROBLEM: Function call failed"
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.nature_remo_sensor must be replaced
-/+ resource "aws_dynamodb_table" "nature_remo_sensor" {
      ~ arn              = "arn:aws:dynamodb:ap-northeast-1:188529565947:table/nature-remo-sensor-2" -> (known after apply)
      ~ hash_key         = "DeviceID" -> "SensorType" # forces replacement
      ~ id               = "nature-remo-sensor-2" -> (known after apply)
      ~ name             = "nature-remo-sensor-2" -> "nature-remo-sensor" # forces replacement
      ~ read_capacity    = 0 -> (known after apply)
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
      ~ write_capacity   = 0 -> (known after apply)
        # (2 unchanged attributes hidden)

      - attribute {
          - name = "DeviceID" -> null
          - type = "S" -> null
        }
      + attribute {
          + name = "SensorType"
          + type = "S"
        }

      ~ point_in_time_recovery {
          ~ enabled = false -> (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      ~ ttl {
          + attribute_name = (known after apply)
          ~ enabled        = false -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_lambda_function.nature_remo_to_dynamo will be updated in-place
  ~ resource "aws_lambda_function" "nature_remo_to_dynamo" {
      ~ handler                        = "nature_remo_to_dynamo.handler" -> "main.handler"
        id                             = "nature_remo_to_dynamo"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.soracom_button_to_slack will be updated in-place
  ~ resource "aws_lambda_function" "soracom_button_to_slack" {
      ~ handler                        = "soracom_button_to_slack.handler" -> "main.handler"
        id                             = "soracom_button_to_slack"
        tags                           = {}
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.


```
</details>
*Pusher: @tadyjp, Action: `pull_request`*